MikroElektronika/core_packages/PIC/XC8/def/PIC16LF19197/mcu.h
// Register: SMT1CPWL
#define SMT1CPWL SMT1CPWL
extern volatile unsigned char           SMT1CPWL            __at(0x492);
#ifndef _LIB_BUILD
asm("SMT1CPWL equ 0492h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CPW                    :8;
    };
    struct {
        unsigned CPW0                   :1;
        unsigned CPW1                   :1;
        unsigned CPW2                   :1;
        unsigned CPW3                   :1;
        unsigned CPW4                   :1;
        unsigned CPW5                   :1;
        unsigned CPW6                   :1;
        unsigned CPW7                   :1;
    };
    struct {
        unsigned SMT1CPW                :8;
    };
    struct {
        unsigned SMT1CPW0               :1;
        unsigned SMT1CPW1               :1;
        unsigned SMT1CPW2               :1;
        unsigned SMT1CPW3               :1;
        unsigned SMT1CPW4               :1;
        unsigned SMT1CPW5               :1;
        unsigned SMT1CPW6               :1;
        unsigned SMT1CPW7               :1;
    };
} SMT1CPWLbits_t;
extern volatile SMT1CPWLbits_t SMT1CPWLbits __at(0x492);
// bitfield macros
#define _SMT1CPWL_CPW_POSN                                  0x0
#define _SMT1CPWL_CPW_POSITION                              0x0
#define _SMT1CPWL_CPW_SIZE                                  0x8
#define _SMT1CPWL_CPW_LENGTH                                0x8
#define _SMT1CPWL_CPW_MASK                                  0xFF
#define _SMT1CPWL_CPW0_POSN                                 0x0
#define _SMT1CPWL_CPW0_POSITION                             0x0
#define _SMT1CPWL_CPW0_SIZE                                 0x1
#define _SMT1CPWL_CPW0_LENGTH                               0x1
#define _SMT1CPWL_CPW0_MASK                                 0x1
#define _SMT1CPWL_CPW1_POSN                                 0x1
#define _SMT1CPWL_CPW1_POSITION                             0x1
#define _SMT1CPWL_CPW1_SIZE                                 0x1
#define _SMT1CPWL_CPW1_LENGTH                               0x1
#define _SMT1CPWL_CPW1_MASK                                 0x2
#define _SMT1CPWL_CPW2_POSN                                 0x2
#define _SMT1CPWL_CPW2_POSITION                             0x2
#define _SMT1CPWL_CPW2_SIZE                                 0x1
#define _SMT1CPWL_CPW2_LENGTH                               0x1
#define _SMT1CPWL_CPW2_MASK                                 0x4
#define _SMT1CPWL_CPW3_POSN                                 0x3
#define _SMT1CPWL_CPW3_POSITION                             0x3
#define _SMT1CPWL_CPW3_SIZE                                 0x1
#define _SMT1CPWL_CPW3_LENGTH                               0x1
#define _SMT1CPWL_CPW3_MASK                                 0x8
#define _SMT1CPWL_CPW4_POSN                                 0x4
#define _SMT1CPWL_CPW4_POSITION                             0x4
#define _SMT1CPWL_CPW4_SIZE                                 0x1
#define _SMT1CPWL_CPW4_LENGTH                               0x1
#define _SMT1CPWL_CPW4_MASK                                 0x10
#define _SMT1CPWL_CPW5_POSN                                 0x5
#define _SMT1CPWL_CPW5_POSITION                             0x5
#define _SMT1CPWL_CPW5_SIZE                                 0x1
#define _SMT1CPWL_CPW5_LENGTH                               0x1
#define _SMT1CPWL_CPW5_MASK                                 0x20
#define _SMT1CPWL_CPW6_POSN                                 0x6
#define _SMT1CPWL_CPW6_POSITION                             0x6
#define _SMT1CPWL_CPW6_SIZE                                 0x1
#define _SMT1CPWL_CPW6_LENGTH                               0x1
#define _SMT1CPWL_CPW6_MASK                                 0x40
#define _SMT1CPWL_CPW7_POSN                                 0x7
#define _SMT1CPWL_CPW7_POSITION                             0x7
#define _SMT1CPWL_CPW7_SIZE                                 0x1
#define _SMT1CPWL_CPW7_LENGTH                               0x1
#define _SMT1CPWL_CPW7_MASK                                 0x80
#define _SMT1CPWL_SMT1CPW_POSN                              0x0
#define _SMT1CPWL_SMT1CPW_POSITION                          0x0
#define _SMT1CPWL_SMT1CPW_SIZE                              0x8
#define _SMT1CPWL_SMT1CPW_LENGTH                            0x8
#define _SMT1CPWL_SMT1CPW_MASK                              0xFF
#define _SMT1CPWL_SMT1CPW0_POSN                             0x0
#define _SMT1CPWL_SMT1CPW0_POSITION                         0x0
#define _SMT1CPWL_SMT1CPW0_SIZE                             0x1
#define _SMT1CPWL_SMT1CPW0_LENGTH                           0x1
#define _SMT1CPWL_SMT1CPW0_MASK                             0x1
#define _SMT1CPWL_SMT1CPW1_POSN                             0x1
#define _SMT1CPWL_SMT1CPW1_POSITION                         0x1
#define _SMT1CPWL_SMT1CPW1_SIZE                             0x1
#define _SMT1CPWL_SMT1CPW1_LENGTH                           0x1
#define _SMT1CPWL_SMT1CPW1_MASK                             0x2
#define _SMT1CPWL_SMT1CPW2_POSN                             0x2
#define _SMT1CPWL_SMT1CPW2_POSITION                         0x2
#define _SMT1CPWL_SMT1CPW2_SIZE                             0x1
#define _SMT1CPWL_SMT1CPW2_LENGTH                           0x1
#define _SMT1CPWL_SMT1CPW2_MASK                             0x4
#define _SMT1CPWL_SMT1CPW3_POSN                             0x3
#define _SMT1CPWL_SMT1CPW3_POSITION                         0x3
#define _SMT1CPWL_SMT1CPW3_SIZE                             0x1
#define _SMT1CPWL_SMT1CPW3_LENGTH                           0x1
#define _SMT1CPWL_SMT1CPW3_MASK                             0x8
#define _SMT1CPWL_SMT1CPW4_POSN                             0x4
#define _SMT1CPWL_SMT1CPW4_POSITION                         0x4
#define _SMT1CPWL_SMT1CPW4_SIZE                             0x1
#define _SMT1CPWL_SMT1CPW4_LENGTH                           0x1
#define _SMT1CPWL_SMT1CPW4_MASK                             0x10
#define _SMT1CPWL_SMT1CPW5_POSN                             0x5
#define _SMT1CPWL_SMT1CPW5_POSITION                         0x5
#define _SMT1CPWL_SMT1CPW5_SIZE                             0x1
#define _SMT1CPWL_SMT1CPW5_LENGTH                           0x1
#define _SMT1CPWL_SMT1CPW5_MASK                             0x20
#define _SMT1CPWL_SMT1CPW6_POSN                             0x6
#define _SMT1CPWL_SMT1CPW6_POSITION                         0x6
#define _SMT1CPWL_SMT1CPW6_SIZE                             0x1
#define _SMT1CPWL_SMT1CPW6_LENGTH                           0x1
#define _SMT1CPWL_SMT1CPW6_MASK                             0x40
#define _SMT1CPWL_SMT1CPW7_POSN                             0x7
#define _SMT1CPWL_SMT1CPW7_POSITION                         0x7
#define _SMT1CPWL_SMT1CPW7_SIZE                             0x1
#define _SMT1CPWL_SMT1CPW7_LENGTH                           0x1
#define _SMT1CPWL_SMT1CPW7_MASK                             0x80

// Register: SMT1CPWH
#define SMT1CPWH SMT1CPWH
extern volatile unsigned char           SMT1CPWH            __at(0x493);
#ifndef _LIB_BUILD
asm("SMT1CPWH equ 0493h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CPW                    :8;
    };
    struct {
        unsigned CPW8                   :1;
        unsigned CPW9                   :1;
        unsigned CPW10                  :1;
        unsigned CPW11                  :1;
        unsigned CPW12                  :1;
        unsigned CPW13                  :1;
        unsigned CPW14                  :1;
        unsigned CPW15                  :1;
    };
    struct {
        unsigned SMT1CPW                :8;
    };
    struct {
        unsigned SMT1CPW8               :1;
        unsigned SMT1CPW9               :1;
        unsigned SMT1CPW10              :1;
        unsigned SMT1CPW11              :1;
        unsigned SMT1CPW12              :1;
        unsigned SMT1CPW13              :1;
        unsigned SMT1CPW14              :1;
        unsigned SMT1CPW15              :1;
    };
} SMT1CPWHbits_t;
extern volatile SMT1CPWHbits_t SMT1CPWHbits __at(0x493);
// bitfield macros
#define _SMT1CPWH_CPW_POSN                                  0x0
#define _SMT1CPWH_CPW_POSITION                              0x0
#define _SMT1CPWH_CPW_SIZE                                  0x8
#define _SMT1CPWH_CPW_LENGTH                                0x8
#define _SMT1CPWH_CPW_MASK                                  0xFF
#define _SMT1CPWH_CPW8_POSN                                 0x0
#define _SMT1CPWH_CPW8_POSITION                             0x0
#define _SMT1CPWH_CPW8_SIZE                                 0x1
#define _SMT1CPWH_CPW8_LENGTH                               0x1
#define _SMT1CPWH_CPW8_MASK                                 0x1
#define _SMT1CPWH_CPW9_POSN                                 0x1
#define _SMT1CPWH_CPW9_POSITION                             0x1
#define _SMT1CPWH_CPW9_SIZE                                 0x1
#define _SMT1CPWH_CPW9_LENGTH                               0x1
#define _SMT1CPWH_CPW9_MASK                                 0x2
#define _SMT1CPWH_CPW10_POSN                                0x2
#define _SMT1CPWH_CPW10_POSITION                            0x2
#define _SMT1CPWH_CPW10_SIZE                                0x1
#define _SMT1CPWH_CPW10_LENGTH                              0x1
#define _SMT1CPWH_CPW10_MASK                                0x4
#define _SMT1CPWH_CPW11_POSN                                0x3
#define _SMT1CPWH_CPW11_POSITION                            0x3
#define _SMT1CPWH_CPW11_SIZE                                0x1
#define _SMT1CPWH_CPW11_LENGTH                              0x1
#define _SMT1CPWH_CPW11_MASK                                0x8
#define _SMT1CPWH_CPW12_POSN                                0x4
#define _SMT1CPWH_CPW12_POSITION                            0x4
#define _SMT1CPWH_CPW12_SIZE                                0x1
#define _SMT1CPWH_CPW12_LENGTH                              0x1
#define _SMT1CPWH_CPW12_MASK                                0x10
#define _SMT1CPWH_CPW13_POSN                                0x5
#define _SMT1CPWH_CPW13_POSITION                            0x5
#define _SMT1CPWH_CPW13_SIZE                                0x1
#define _SMT1CPWH_CPW13_LENGTH                              0x1
#define _SMT1CPWH_CPW13_MASK                                0x20
#define _SMT1CPWH_CPW14_POSN                                0x6
#define _SMT1CPWH_CPW14_POSITION                            0x6
#define _SMT1CPWH_CPW14_SIZE                                0x1
#define _SMT1CPWH_CPW14_LENGTH                              0x1
#define _SMT1CPWH_CPW14_MASK                                0x40
#define _SMT1CPWH_CPW15_POSN                                0x7
#define _SMT1CPWH_CPW15_POSITION                            0x7
#define _SMT1CPWH_CPW15_SIZE                                0x1
#define _SMT1CPWH_CPW15_LENGTH                              0x1
#define _SMT1CPWH_CPW15_MASK                                0x80
#define _SMT1CPWH_SMT1CPW_POSN                              0x0
#define _SMT1CPWH_SMT1CPW_POSITION                          0x0
#define _SMT1CPWH_SMT1CPW_SIZE                              0x8
#define _SMT1CPWH_SMT1CPW_LENGTH                            0x8
#define _SMT1CPWH_SMT1CPW_MASK                              0xFF
#define _SMT1CPWH_SMT1CPW8_POSN                             0x0
#define _SMT1CPWH_SMT1CPW8_POSITION                         0x0
#define _SMT1CPWH_SMT1CPW8_SIZE                             0x1
#define _SMT1CPWH_SMT1CPW8_LENGTH                           0x1
#define _SMT1CPWH_SMT1CPW8_MASK                             0x1
#define _SMT1CPWH_SMT1CPW9_POSN                             0x1
#define _SMT1CPWH_SMT1CPW9_POSITION                         0x1
#define _SMT1CPWH_SMT1CPW9_SIZE                             0x1
#define _SMT1CPWH_SMT1CPW9_LENGTH                           0x1
#define _SMT1CPWH_SMT1CPW9_MASK                             0x2
#define _SMT1CPWH_SMT1CPW10_POSN                            0x2
#define _SMT1CPWH_SMT1CPW10_POSITION                        0x2
#define _SMT1CPWH_SMT1CPW10_SIZE                            0x1
#define _SMT1CPWH_SMT1CPW10_LENGTH                          0x1
#define _SMT1CPWH_SMT1CPW10_MASK                            0x4
#define _SMT1CPWH_SMT1CPW11_POSN                            0x3
#define _SMT1CPWH_SMT1CPW11_POSITION                        0x3
#define _SMT1CPWH_SMT1CPW11_SIZE                            0x1
#define _SMT1CPWH_SMT1CPW11_LENGTH                          0x1
#define _SMT1CPWH_SMT1CPW11_MASK                            0x8
#define _SMT1CPWH_SMT1CPW12_POSN                            0x4
#define _SMT1CPWH_SMT1CPW12_POSITION                        0x4
#define _SMT1CPWH_SMT1CPW12_SIZE                            0x1
#define _SMT1CPWH_SMT1CPW12_LENGTH                          0x1
#define _SMT1CPWH_SMT1CPW12_MASK                            0x10
#define _SMT1CPWH_SMT1CPW13_POSN                            0x5
#define _SMT1CPWH_SMT1CPW13_POSITION                        0x5
#define _SMT1CPWH_SMT1CPW13_SIZE                            0x1
#define _SMT1CPWH_SMT1CPW13_LENGTH                          0x1
#define _SMT1CPWH_SMT1CPW13_MASK                            0x20
#define _SMT1CPWH_SMT1CPW14_POSN                            0x6
#define _SMT1CPWH_SMT1CPW14_POSITION                        0x6
#define _SMT1CPWH_SMT1CPW14_SIZE                            0x1
#define _SMT1CPWH_SMT1CPW14_LENGTH                          0x1
#define _SMT1CPWH_SMT1CPW14_MASK                            0x40
#define _SMT1CPWH_SMT1CPW15_POSN                            0x7
#define _SMT1CPWH_SMT1CPW15_POSITION                        0x7
#define _SMT1CPWH_SMT1CPW15_SIZE                            0x1
#define _SMT1CPWH_SMT1CPW15_LENGTH                          0x1
#define _SMT1CPWH_SMT1CPW15_MASK                            0x80

